# дано опис класу MyData
'''
class MyData:
    pass
'''
# Додати функціонал об'єкту який
# 1 при додавання до об'єкта буде повертати результатом 10
# 2 при відніманні від об'єкта буде повертати 100
# 3 при перетворені на стрічку буде повертати стрічку число
# 4 при переведенні до числа буде результатом 123

class MyData:
    def __add__(self,num):
        return 10
    
    def __sub__(self, num):
        return 100
    
    def __str__(self):
        return "123"
    
    def __int__(self):
        return 123
    
d = MyData()
print(int(d))
